CSI API ETABS v1

# cOAPIInternalExec Method

---

For internal use.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int InternalExec(
    	int operation
    )

    Function InternalExec (
    	operation As Integer
    ) As Integer

    Dim instance As cOAPI
    Dim operation As Integer
    Dim returnValue As Integer

    returnValue = instance.InternalExec(operation)

    int InternalExec(
    	int operation
    )

    abstract InternalExec :
            operation : int -> int

#### Parameters

operation

    Type: SystemInt32

#### Return Value

Type: Int32
For internal use.

Remarks

For internal use.

See Also

#### Reference

cOAPI Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com